Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/organization.po
Languages: uk

source: Schema
uk: Схема

source: string, multilingual
uk: рядок, багатомовний

source: List of :ref:`identifier` objects
uk: Список об’єктів :ref:`identifier`

source: string
uk: рядок

source: |ocdsDescription| Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.
uk: |ocdsDescription| Ідентифікатори організації беруться з існуючої схеми ідентифікації. Це поле вказує схему або список кодів, де можна знайти ідентифікатор організації. Це значення повинно братись зі Схеми Ідентифікації Організацій.

source: |ocdsDescription| The identifier of the organization in the selected scheme.
uk: |ocdsDescription| Ідентифікатор організації у вибраній схемі.

source: |ocdsDescription| The legally registered name of the organization.
uk: |ocdsDescription| Легально зареєстрована назва організації.

source: |ocdsDescription| A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.
uk: |ocdsDescription| URI для ідентифікації організації, наприклад, ті, які надають Open Corporates або інші постачальники URI. Це не для вебсайту організації, його можна надати в полі url в ContactPoint організації.

source: Company
uk: Компанія

source: City
uk: Місто

source: Street
uk: Вулиця

source: Country
uk: Країна

source: Person
uk: Людина

source: Phone
uk: Телефон

source: Website
uk: Вебсайт

source: :ref:`Address`, required
uk: :ref:`Address`, обов’язково

source: :ref:`ContactPoint`, required
uk: :ref:`ContactPoint`, обов’язково

source: string, required
uk: рядок, обов’язковий

source: string, multilingual, required
uk: рядок, багатомовний, обов’язковий

source: The allowed codes are the ones found in `"Organisation Registration Agency" codelist of IATI Standard <http://iatistandard.org/codelists/OrganisationRegistrationAgency/>`_ with addition of `UA-EDR` code for organizations registered in Ukraine (EDRPOU and IPN).
uk: Дозволеними є коди зі `спику кодів "Organisation Registration Agency" Стандарту IATI <http://iatistandard.org/codelists/OrganisationRegistrationAgency/>`_ з додаванням коду `UA-EDR` для організацій, зареєстрованих в Україні (ЄДРПОУ та ІПН).

source: |ocdsDescription| The common name of the organization.
uk: |ocdsDescription| Назва організації.

source: |ocdsDescription| The primary identifier for this organization.
uk: |ocdsDescription| Ідентифікатор цієї організації.

source: |ocdsDescription| The street address. For example, 1600 Amphitheatre Pkwy.
uk: |ocdsDescription| Вулиця. Наприклад, вул.Хрещатик, 22.

source: |ocdsDescription| The locality. For example, Mountain View.
uk: |ocdsDescription| Населений пункт. Наприклад, Київ.

source: |ocdsDescription| The region. For example, CA.
uk: |ocdsDescription| Область. Наприклад, Київська.

source: |ocdsDescription| The postal code. For example, 94043.
uk: |ocdsDescription| Поштовий індекс, Наприклад, 78043.

source: |ocdsDescription| The country name. For example, United States.
uk: |ocdsDescription| Назва країни. Наприклад, Україна.

source: |ocdsDescription| The name of the contact person, department, or contact point, for correspondence relating to this contracting process.
uk: |ocdsDescription| Ім’я контактної особи, назва відділу чи контактного пункту для листування, що стосується цього процесу укладання договору.

source: |ocdsDescription| The e-mail address of the contact point/person.
uk: |ocdsDescription| Адреса електронної пошти контактної особи/пункту.

source: |ocdsDescription| The telephone number of the contact point/person. This should include the international dialling code.
uk: |ocdsDescription| Номер телефону контактної особи/пункту. Повинен включати міжнародний телефонний код.

source: |ocdsDescription| The fax number of the contact point/person. This should include the international dialling code.
uk: |ocdsDescription| Номер факсу контактної особи/пункту. Повинен включати міжнародний телефонний код.

source: |ocdsDescription| A web address for the contact point/person.
uk: |ocdsDescription| Веб адреса контактної особи/пункту.

source: Either `email` or `telephone` field has to be provided.
uk: Повинне бути заповнене хоча б одне з полів: або `email`, або `telephone`.
