Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/authentication.po
Languages: uk

source: Authentication
uk: Аутентифікація

source: API keys
uk: Ключі API

source: API key is username to use with Basic Authenication scheme.
uk: Ключ API - це ім’я користувача, що буде використовуватись зі схемою Базової аутентифікації.

source: Owner tokens
uk: Токени власника

source: The token is issued when object is created in the database:
uk: Токен видається, коли об'єкт створюється в базі даних:

source: Some of the API requests (especially the ones that are read-only GET requests) do not require any authenication. The other ones, that modify data into the database, require broker authentication via API key. Additionally, owner tokens are issued to facilitate multiple actor roles upon object creation.
uk: Деякі запити API (особливо GET запити лише для читання) не потребують аутентифікації. Інші, ті, які модифікують дані у базі даних, потребують аутентифікації брокера через ключ API. Додатково видаються токени власника, щоб забезпечити кілька ролей дійових осіб при створенні об’єкта.

source: Getting token
uk: Отримання токена

source: You can see the `access` with `token` in response. Its value can be used to modify objects further under "Owner role".
uk: У відповіді є `access` разом з `token`. Це значення можна використати для модифікації об’єктів у "ролі Власника".

source: Using token
uk: Використання токена

source: `acc_token` URL query string parameter
uk: параметр рядка URL запиту `acc_token`

source: `X-Access-Token` HTTP request header
uk: заголовок HTTP запиту `X-Access-Token`

source: `access.token` in the body of POST/PUT/PATCH request
uk: `access.token` в тілі запитів POST/PUT/PATCH

source: See the example of the action with token passed as URL query string:
uk: Ось приклад, де токен передається як рядок URL запиту:

source: You can pass access token in the following ways:
uk: Ви можете передати токен доступу такими способами:
