Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/bidding.po
Languages: uk

source: Bidder Operations
uk: Операції для учасників закупівлі

source: Registration of Bid proposal
uk: Реєстрація цінової пропозиції

source: Uploading Bid documents
uk: Завантаження документів пропозиції

source: Update of proposal
uk: Оновлення пропозиції

source: Updating Bid documents
uk: Оновлення документів пропозиції

source: Cancelling the proposal
uk: Відміна пропозиції

source: Bids Listing
uk: Список пропозицій

source: Retrieving the proposal
uk: Вичитка пропозиції

source: After auction ends it is possible to get full information about bids and bidders that submitted them:
uk: Після закінчення аукціону можна отримати повну інформацію про пропозиції та учасників, які їх подали:

source: Individual bid can be retrieved via its `id`:
uk: Окрему пропозицію можна прочитати за її `id`:
