Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/complaints-tender.po
Languages: uk

source: Rejecting Tender Conditions Complaint
uk: Відхилення скарги на умови закупівлі

source: Submitting Tender Conditions Complaint Resolution
uk: Подання рішення по скарзі на умови закупівлі

source: The Complaint Review Body uploads the resolution document:
uk: Орган, що розглядає скарги, завантажує документ з рішенням:

source: Or declines it:
uk: Або відхиляє:

source: And either resolves complaint:
uk: Який або вирішує скаргу:

source: Answer to resolved claim
uk: Відповідь на вирішену вимогу

source: Satisfying resolution
uk: Рішення про задоволення вимоги

source: Escalate claim to complaint
uk: Перетворення вимоги в скаргу

source: At first create a claim:
uk: Спочатку створимо вимогу:

source: Then upload necessary documents:
uk: Потім завантажимо документи:

source: Submit tender conditions claim:
uk: Подамо вимогу про виправлення умов закупівлі:

source: Claim Submission
uk: Подання вимоги

source: Tender Conditions Claim Submission (with documents)
uk: Подання вимоги про виправлення умов закупівлі (з документами)

source: Tender Conditions Claim Submission (without documents)
uk: Подання вимоги про виправлення умов закупівлі (без документів)

source: Claim's Answer
uk: Відповідь на вимогу

source: Satisfied Claim
uk: Задоволена вимога

source: Complaint Resolution
uk: Вирішення скарги

source: Tender Conditions Claim/Complaint Retrieval
uk: Отримання інформації про вимоги/скарги на умови закупівлі

source: You can list all Tender Conditions Claims/Complaints:
uk: Ви можете отримати список всіх вимог/скарг на умови закупівлі:

source: And check individual complaint or claim:
uk: Або перевірити окрему скаргу чи вимогу:

source: If tender conditions are favoriting particular supplier, or in any other viable case, one can submit Tender Conditions Claim.
uk: Якщо умови закупівлі сприятливі лише для одного постачальника або при будь-якому іншому серйозному порушенні можна подати вимогу про виправлення умов закупівлі.

source: Create claim that does not need additional documents:
uk: Ви можете подати скаргу, що не потребує додаткових документів:
