Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/errors.po
Languages: uk

source: Responses
uk: Відповіді

source: After processing API always provides response, reporting either success or failure.
uk: Після обробки API завжди надає відповідь, звітуючи або про успіх, або про помилку.

source: Status Codes
uk: Коди стану

source: In all cases, the API should return an `HTTP Status Code <http://en.wikipedia.org/wiki/List_of_HTTP_status_codes>`_ that indicates the nature of the failure (see below), with a response body in JSON format containing additional information.
uk: У будь-якому випадку API повинен повернути `Код стану HTTP <http://en.wikipedia.org/wiki/List_of_HTTP_status_codes>`_, що вказуватиме природу помилки (див. внизу), з тілом відповіді у форматі JSON, що міститиме додаткову інформацію.

source: Success. If data was requested, it will be available in the `data` field at the top level of the response body.
uk: Успіх. Якщо це був запит про інформацію, то вона буде доступна у `data` полі на верхньому рівні тіла відповіді.

source: Success (for object creation). Its information is available in the `data` field at the top level of the response body. The API URL where the object can be retrieved is also returned in the `Location` header of the response.
uk: Створено. Його інформація доступна у `data` полі на верхньому рівні тіла відповіді. API URL, де об’єкт можна прочитати, міститься у `Location` заголовку відповіді.

source: Invalid request. This usually occurs because of a missing or malformed parameter. Check the documentation and the syntax of your request and try again.
uk: Неправильний запит. Зазвичай це відбувається через відсутній або неправильний параметр. Перевірте документацію та синтаксис вашого запиту і спробуйте ще раз.

source: No authorization. A valid API key was not provided with the request, so the API could not associate a user with the request.
uk: Несанкційонований доступ. Не було надано дійсного API ключа разом із запитом, тому API не може зв'язати користувача із запитом.

source: Forbidden. The API key and request syntax was valid but the server is refusing to complete the request. This can happen if you are trying to read or write to objects or properties that you do not have access to.
uk: Заборонено. API ключ та синтаксис запиту були дійсними, але сервер відмовляється виконати запит. Це може статися, якщо ви пробуєте прочитати або записати об'єкти чи властивості, до яких не маєте доступу.

source: Not found. Either the request method and path supplied do not specify a known action in the API, or the object specified by the request does not exist.
uk: Ресурс не знайдено. Або даний метод та шлях запиту не вказують відому дію для API, або об’єкт, вказаний у запиті, не існує.

source: Conflict. Indicates that the request could not be processed because of conflict in the request, such as an edit conflict between multiple simultaneous updates.
uk: Конфлікт. Вказує, що запит не може бути опрацьований через конфлікт у запиті, наприклад, конфлікт одночасного редагування.

source: Precondition Failed. See :ref:`API in cluster mode <cluster>`.
uk: Збій під час обробки попередньої умови. Дивіться розділ :ref:`Pобота з API в режимі кластеру <cluster>`.

source: Rate Limit Enforced. See :ref:`Rate control <performance>`.
uk: Перевищено допустиму частоту запитів. Дивіться розділ :ref:`Контроль частоти запитів <performance>`.

source: Any **5xx error** response means abnormal request processing situation and should be reported to technical support.
uk: Будь-яка **5xx помилка** означає проблемну ситуацію з обробкою запиту. Повідомте про таку помилку техпідтримку.

source: Platform has to properly react to 5xx errors because such errors do not necessarily guarantee that request has not been performed. For repeatable operations (such as :ref:`2-phase commit <2pc>`, field value modifications, etc.) you should repeat the request with some interval. The time interval has to be increased for each of the following repeated requests.
uk: Майданчик повинен коректно реагувати на 5xx помилки, оскільки такі помилки не завжди гарантують, що запит не відбувся. У випадку виникнення будь-якої з 5хх помилок та для повторюваних операцій (таких, як двофазний коміт, модифікації значення поля і т.п.), потрібно повторювати запит з деяким інтервалом. Часовий інтервал потрібно збільшувати для кожного наступного повторення запиту.

source: Request repetition can be applied only to a specific phase of the operation. For example, if in case of executing a 2-phase commit the first phase was executed successfully (a tender was created in status `draft`), but the second phase (tender publication) failed with a 5xx error, then the request should be repeated only for the not executed phase (only for tender publication).
uk: Повторення запиту стосується лише конкретної фази операції. Наприклад, якщо при здійсненні 2-фазного коміту перша фаза пройшла успішно (створено закупівлю у статусі `draft`), а при виконанні другої (публікації закупівлі) виникла помилка 5хх, то потрібно застосовувати повторення запиту лише для нездійсненої фази (лише для публікації закупівлі).

source: For other operations (such as document upload, etc.) you should check modified object data (tender, bid, award, etc.) with bigger interval (5-10 min).
uk: Для решти операцій (таких, як завантаження документа і т.п.) ви повинні періодично (5-10 хв) перевіряти дані модифікованого об’єкта (закупівлі, пропозиції, конктракту і т.п.).

source: Server error. There was a problem on OpenProcurement's end.
uk: Помилка сервера. Була проблема зі сторони OpenProcurement.

source: Not Implemented. The server either does not recognize the request method, or it lacks the ability to fulfill the request. Re-check the request consistency.
uk: Метод не підтримується. Сервер або не розпізнає метод запиту, або в нього немає можливості його виконати. Повторно перевірте відповідність запиту.

source: Bad Gateway. The server received an invalid response or backend is not ready to handle requests. Repeat request for repeatable operations or check object data with interval 1-5 min.
uk: Помилка шлюзу. Сервер отримав відповідь про помилку чи не готовий обробляти запити. Для повторюваних операцій повторіть запит або перевіряйте дані об'єкту з інтервалом 1-5 хв.

source: Service Unavailable. The server is currently unavailable (because it is overloaded or down for maintenance). Generally, this is a temporary state.
uk: Сервіс недоступний. На даний момент сервер недоступний (через перевантаження чи технічне обслуговування). Переважно ця помилка тимчасова.

source: Gateway Time-out. The server did not receive a timely response. Repeat request for repeatable operations or check object data with interval 1-5 min.
uk: Шлюз не відповідає. Сервер не дочекався відповіді. Для повторюваних операцій повторіть запит або перевіряйте дані об'єкту з інтервалом 1-5 хв.

source: HTTP Version Not Supported. The server does not support the HTTP protocol version used in the request. Re-check the request consistency.
uk: Версія НТТР не підтримується. Сервер не підтримує версію протоколу HTTP, використану у запиті. Повторно перевірте відповідність запиту.

source: Success Response
uk: Відповідь з повідомленням про успіх

source: Every successful get, create, update, replace request results in response that contains `data` attribute. That `data` attribute contains full JSON object representation after the operation. If some data were generated in the result of processing (like new object IDs, or `modified` date) they are present in the respose.
uk: Кожен успішний запит вичитки, створення, оновлення, чи заміни отримує відповідь, що містить `data` атрибут. Цей `data` атрибут містить повне представлення JSON об’єкта після операції. Якщо деякі дані були згенеровані у результаті обробки (наприклад, нові ID об’єкта або `modified` дата), то вони присутні у відповіді.

source: The listing requests result in similar responses, but instead of single object in `data` attribute, the JSON response contains collection of objects.
uk: Запити списку отримують схожі відповіді, але замість одного об'єкта в `data` атрибуті, JSON відповідь містить колекцію об'єктів.

source: Example Succes Response
uk: Приклад відповіді з повідомленням про успіх

source: Here is a response that describes tender
uk: Це відповідь, що описує закупівлю.

source: Error Response
uk: Відповідь з повідомленням про помилку

source: In the event of an error, the response body will contain an `errors` field at the top level. It contains an array of at least one error object, described below:
uk: У випадку помилки, тіло відповіді міститиме `errors` поле на вищому рівні. Воно містить масив як мінімум одного помилкового об’єкта описаного нижче:

source: Part of the request causing the error. Possible values are `header` and `body`.
uk: Частина запиту спричинює помилку. Можливі значення це `header` (заголовок) або `body` (тіло).

source: Specific header name that caused the problem (in case of `header` location)
uk: Конкретна назва заголовку, що спричиняє проблему (у випадку місцярозташування `заголовок`)

source: The field name causing the error (in case of `body` location)
uk: Конкретна назва поля, що спричиняє проблему (у випадку місцярозташування `тіло`)

source: Verbose (human readable) description of the error.
uk: Докладний (придатний для читання людиною) опис помилки.

source: Example Error Response
uk: Приклад відповіді з повідомленням про помилку

source: Sample below indicates incomplete request.
uk: Зразок нижче вказує на неповний запит.
