Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/lots.po
Languages: uk

source: Tenders with multiple Lots
uk: Багатолотові закупівлі

source: Multilot Tender shares general documentation, and can have lot-specific and even item-specific documentation.
uk: Багатолотова закупівля може мати документацію для процедури в цілому, окремо для лота та окремо для елемента.

source: The same applies to :ref:`Questions <question>` and answers. Question placed in Tender can be general, lot-specific or item-specific.
uk: Те саме стосується і :ref:`запитань <question>` та відповідей. Питання може бути по процедурі в цілому, окремо для лота та окремо для елемента.

source: When bidding, provider can place bid against single lot, multiple lots or even all lots of the tender.
uk: На торгах учасник може подавати пропозицію для одного лота, декількох лотів, або навіть для всіх лотів закупівлі.

source: Each of the :ref:`documents <document>` attached to the :ref:`Bid` can be general, lot-specific or item-specific.
uk: Кожен :ref:`документ <document>`, вкладений до :ref:`пропозиції <bid>`, може стосуватись процедури в цілому, окремого лота або окремого елемента.

source: Each Lot can be cancelled individually, not affecting processes that take place in other lots.
uk: Кожен лот можна скасувати окремо, не впливаючи на інші лоти.

source: Announcing Multilot tender
uk: Оголошення багатолотової закупівлі

source: 2nd lot:
uk: Другий лот:

source: Items should be distributed among the lots.
uk: Елементи повинні бути розподілені по лотах.

source: Bidding in Multilot tender
uk: Подання пропозицій у багатолотовій закупівлі

source: Bid should have `lotValues` property consisting of multiple :ref:`LotValue` objects. Each should reference lot the bid is placed against via `relatedLot` property.
uk: Цінова пропозиція повинна мати властивість `lotValues`, що складається з декількох об’єктів :ref:`LotValue`. Кожен з них повинен посилатись на лот, до якого подана пропозиція, через властивість `relatedLot`.

source: Qualification in Multilot tender
uk: Кваліфікація у багатолотових закупівлях

source: When having tender with separate items that can be supplied by different providers it is possible to split the tender into :ref:`Lots <lot>`. Each Lot has its own budget (i.e. `Lot.value`).
uk: Якщо є закупівля з декількома різними елементами, що можуть бути куплені у різних постачальників, то можна розділити цю процедуру закупівлі на :ref:`лоти <lot>`. Кожен лот має свій власний бюджет (`Lot.value`).

source: Each Lot has its own auction and awarding process.
uk: Кожен лот має окремий аукціон та процес визначення переможця.

source: One has to create Multilot tender in several steps. There should be tender created with items.
uk: Багатолотова закупівля створюється в декілька кроків. Спочатку потрібно створити закупівлю з декількома елементами.

source: Then all lots have to be added to Tender with separate requests.
uk: Потім потрібно додати всі лоти окремими запитами.

source: Auction participation URLs are available for each of the submitted lots.
uk: URL-адреси для участі в аукціоні будуть доступні для кожного з поданих лотів.

source: After Auctions are over each active lot has its own awarding process started. I.e. there are multiple award objects created in :ref:`Tender` each requiring decision (disqualification or acceptance).
uk: ПІсля завершення аукціонів для кожного лота розпочинається його власний процес визначення переможця. Тобто, у :ref:`Tender` створюється декілька об’єктів визначення переможця і кожен з них вимагає рішення (дискваліфікації чи прийняття).

source: When all qualification processes end, and all stand still periods end, the whole tender switch state to either `complete` or `unsuccessful` (if awads for all lots are `unsuccessful`).
uk: Після того, як завершуються всі кваліфікаційні процеси та всі періоди зупинок, вся закупівля змінює статус або на "завершена", або на "не відбулась" (якщо визначення переможців для всіх лотів `не відбулись`).
