Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/merged_contacts.po
Languages: uk

source: Merge contracts
uk: Обʼєднання контрактів

source: For merge contracts `suppliers` must be the same. Let's get contracts.
uk: Для об'єднання контрактів поле suppliers повинне співпадати. Подивимось доступні контракти.

source: Let's merge second contract in the first, for merging the field `additionalAwardIDs` needs to be sent with list of merge awards id. In response we must see `additionalAwardIDs`.
uk: Давайте об'єднаємо контракти, для цього потрібно в головний контракт передати `additionalAwardIDs` зі списком додаткових авардів.

source: Now additional award must have a status `merged`, and field `mergedInto`. We can't make changes in additional contracts.
uk: Всі додаткові контракти повинні бути в статусі `merged`, та мати поле `mergedInto` в якому зберігається id головного контракту. Ми не можемо робити будь-які зміни в додаткових контрактах.

source: Sign main contract
uk: Підпишемо головний контракт

source: Set contract value and sign.
uk: Встановлення вартості угоди.

source: Cancel main award
uk: Скасування головного контракту

source: Let`s cancel award which contract has additional awards.
uk: Давайте скасуємо award, контракт якого містить в собі додаткові контракти.

source: Lets look on contracts
uk: Подивимось на контракти

source: We see that contract and award move in status `cancelled` and each additional contract has changed a status from `merged` to `pending`, and has removed a field `mergeInto`.
uk: Ми бачимо, що контракт та авард перейшли в статус `cancelled` і всі додаткові контракти змінили статус з `merged` на `pending`, та прибрали поле `mergedInto`.

source: Cancel additional award
uk: Відміна додаткового контракту

source: If additional award is canceled, then award and contract will move in status `cancelled`, and ID of award will be deleted from `additionalAwards` in the main contract
uk: При відміні додаткових контрактів, авард та контракт переходят в статус `cancelled`, та ID аварду видалиться зі списку `additionalAwards` з головного контракту

source: Let's look on the main contract
uk: Давайте подивимось на головний контракт
