Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/overview.po
Languages: uk

source: Overview
uk: Огляд

source: The Open Procurement API is the only interface to Open Procurement database that is core unit of `Open Procurement <http://openprocurement.org/>`_ infrastructure.
uk: Open Procurement API це єдиний інтерфейс для бази даних Open Procurement, що є основним елементом інфраструктури `Open Procurement <http://openprocurement.org/>`_.

source: The API accepts `JSON <http://json.org/>`_ or form-encoded content in requests. It returns JSON content in all of its responses, including errors. Only the UTF-8 character encoding is supported for both requests and responses.
uk: API приймає `JSON <http://json.org/>`_ або form-encoded вміст у запитах. Він повертає JSON вміст у всіх свої відповідях, включно з помилками. Підтримується лише UTF-8 кодування і для запитів, і для відповідей.

source: Main responsibilities
uk: Основні задачі

source: Business logic
uk: Бізнес логіка

source: Project status
uk: Стан проекту

source: The project has pre alpha status.
uk: Статус цього проекту - перед-альфа

source: API stability
uk: Стабільність API

source: Change log
uk: Звіт про зміни

source: Set up general build, testing, deployment, and ci framework.
uk: Налаштування загальної збірки, тестування, розгортання та ci фреймворка.

source: Next steps
uk: Наступні кроки

source: You might find it helpful to look at the :ref:`tutorial`, or the :ref:`reference`.
uk: Можливо вам буде цікаво прочитати :ref:`tutorial`, або :ref:`reference`.

source: Conventions
uk: Домовленості

source: All API POST and PUT requests expect a top-level object with a single element in it named `data`. Successful responses will mirror this format. The data element should itself be an object, containing the parameters for the request. In the case of creating a new tender, these are the fields we want to set on the tender itself.
uk: Всі API POST та PUT запити очікують об'єкт верхнього рівня з єдиним елементом з назвою `data`. Відповіді з повідомленням про успіх будуть віддзеркалювати цей формат. Елемент data повинен сам бути об’єктом, що містить параметри запиту. Якщо створюється нова закупівля, то це ті поля, які ми хочемо встановити на самій закупівлі.

source: If the request was successful, we will get a response code of `201` indicating the object was created. That response will have a data field at its top level, which will contain complete information on the new tender, including its ID.
uk: Якщо запит був успішним, ми отримаємо код відповіді `201`, який вказує, що об’єкт був створений. Ця відповідь буде мати data поле на верхньому рівні, яке вміщуватиме повну інформацію про нову закупівлю, включно з ID.

source: API is highly unstable, and while API endpoints are expected to remain relatively stable the data exchange formats are expected to be changed a lot. The changes in the API are communicated via `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ maillist.
uk: API є дуже нестабільним. Хоча точки входу API будуть відносно стабільними, формати обміну даними будуть часно змінюватись. Зміни в API обговорюються через `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ розсилку.

source: Released: 2014-10-24
uk: Випущено: 2014-10-24

source: Creating/modifying tender
uk: Створення/модифікація закупівлі

source: Adding/modifying/cancelling tender proposal
uk: Додавання/модифікація/відміна цінової пропозиції

source: Awarding/disqualification of tender proposals
uk: Визначення переможця/дискваліфікація цінових пропозицій

source: Tender Listing Batching (optimized for sync operations)
uk: Сортування списку закупівель (оптимізоване для синхронних операцій)

source: Documents retrieval
uk: Вичитка документів

source: Change tracking
uk: Відстеження змін

source: Options: Pretty-print, JSONP
uk: Опції: Pretty-print, JSONP

source: Introduction of state machine and time-based state switching
uk: Впровадження станів та перемикання станів з урахуванням часу

source: Released: 2014-11-07
uk: Випущено: 2014-11-07

source: Released: 2014-11-21
uk: Випущено: 2014-11-21

source: New Features:
uk: Нові властивості:

source: Asking Questions
uk: Можливість задавати питання

source: Filing Complaint on tender conditions
uk: Подача скарги на тендерні умови

source: Answer Question
uk: Можливість відповідати на запитання

source: Publish Complaint resolution
uk: Публікація вирішення скарги

source: Retrieve Questions and Answers, Complaints and Resolutions
uk: Вичитка запитань та відповідей, скарг та їх рішень

source: Auction Scheduler
uk: Планувальник аукціону

source: Auction Runner
uk: Контролер аукціону

source: Modifications:
uk: Модифікації:

source: :ref:`standard` harmonized with `Open Contracting 1.0RC <http://ocds.open-contracting.org/standard/r/1__0__RC/>`_
uk: :ref:`standard` налаштований відповідно до `Open Contracting 1.0RC <http://ocds.open-contracting.org/standard/r/1__0__RC/>`_

source: ``/bidders/`` endpoint renamed into ``/bids/``
uk: точки входу ``/bidders/`` перейменовані в ``/bids/``

source: ``modified`` property renamed into ``modificationDate``
uk: властивість ``modified`` перейменована в ``modificationDate``

source: Released: 2014-12-01
uk: Випущено: 2014-12-01

source: Filing Complaint on award
uk: Подання скарги на визначення переможця

source: Complaint attachments
uk: Додатки до скарг

source: Tender Cancelling
uk: Відміна закупівлі

source: Question authors visibility
uk: Видимість авторів питань

source: Tender status codelist harmonized
uk: Уточнення списку статусів закупівлі

source: Released: 2014-12-15
uk: Випущено: 2014-12-15

source: New features:
uk: Нові властивості:

source: Token Broker authorization
uk: Авторизація токена брокера

source: Actor token authorization
uk: Авторизація токена дійової особи

source: Added Item.deliveryLocation
uk: Додано Item.deliveryLocation

source: Released: not released
uk: Випущено: не випущено

source: Actor token generation
uk: Генерація токена дійової особи

source: Tender.deliveryDate moved to Item.deliveryDate
uk: Tender.deliveryDate перенесено до Item.deliveryDate

source: Added Item.deliveryAddress
uk: Додано Item.deliveryAddress

source: Award sequential review logic
uk: Логіка послідовного розгляду визначення переможця

source: Pending complaints Tender completion blocking
uk: Блокування завершення закупівлі через невирішені скарги

source: Rescheduling of failed auctions
uk: Перенесення невдалих аукціонів

source: Stand-still period for each of the awards independently
uk: Період зупинки для кожної винагороди окремо

source: Released: 2015-03-13
uk: Випущено: 2015-03-13

source: Set title, classification and additionalClassifications required
uk: Обов’язкове встановлення назви, класифікації та additionalClassifications

source: Added validation identical cpv groups of items
uk: Додана валідація для однакових cpv груп товарів

source: Added upload tender documents by auction user
uk: Дадано завантаження документів закупівлі користувачем аукціону

source: Closing tender by signing contract
uk: Закриття закупівлі підписанням контракту

source: Strict mode for patching operation
uk: Жорсткий режим для операцій з патчами

source: Cancalling active award
uk: Відміна активної винагороди

source: Authenticated couchdb access
uk: Автентифікований доступ до бази даних couchdb

source: Fixed authentication of PUT and PATCH methods
uk: Виправлена аутентифікація методів PUT та PATCH

source: Optimized calls to db on start
uk: Оптимізовано запити до БД при старті

source: Fixed deliveryLocation fields
uk: Виправлені поля deliveryLocation

source: Fixed edit format field in Documents
uk: Виправлено поле редагування формату в Документах

source: Fixed restrictions uploading documents of bid
uk: Виправлені обмеження заватаження документів цінової пропозиції

source: Added new cancellation API
uk: Додано новий механізм скасування тендера

source: Released: 2015-05-12
uk: Випущено: 2015-05-12

source: The Open Procurement API is a `REST <http://en.wikipedia.org/wiki/Representational_State_Transfer>`_-ful interface that provides programmatic access to Tender database of Open Procurement system. It provides predictable URLs for accessing resources, and uses built-in HTTP features to receive commands and return responses. This makes it easy to communicate with.
uk: Open Procurement API це `REST <http://en.wikipedia.org/wiki/Representational_State_Transfer>`_-ful інтерфейс, що надає програмний доступ до бази даних Tender системи Open Procurement. Він надає URL-адреси для доступу до ресурсів і використовує вбудовані HTTP особливості, щоб отримувати команди та повертати відповіді. Це полегшує спілкування.

source: If something went wrong during the request, we'll get a different status code and the JSON returned will have an `errors` field at the top level containing a list of problems. We look at the first one and print out its message.
uk: Якщо під час запиту виникли труднощі, ми отримаємо інший код стану та JSON, який при поверненні міститиме `errors` поле на верхньому рівні зі списком проблем. Ми дивимось на першу з них і видруковуємо її повідомлення.

source: :ref:`MEAT tenders <meat>`
uk: :ref:`Закупівлі за принципом найбільш економічно вигідної пропозиції <meat>`

source: :ref:`Multilot tenders <lots>`
uk: :ref:`Багатолотові закупівлі <lots>`

source: The source repository for this project is on GitHub: https://github.com/openprocurement/openprocurement.api
uk: Репозиторій джерельних текстів цього проекту є на `GitHub <https://github.com/openprocurement/openprocurement.api>`_.

source: You can leave feedback by raising a new issue on the `issue tracker <https://github.com/openprocurement/openprocurement.api/issues>`_ (GitHub registration necessary).
uk: Повідомляйте про всі проблеми та поради через `issue tracker <https://github.com/openprocurement/openprocurement.api/issues>`_ (реєстрація на GitHub обов’язкова).

source: For general discussion use `Open Procurement General <https://groups.google.com/group/open-procurement-general>`_ maillist.
uk: Загальне обговорення відбувається через розсилку `Open Procurement General <https://groups.google.com/group/open-procurement-general>`_.

source: General information, roadmap, and technical specifications for the Open Procurement project can be found at `openprocurement.org <http://openprocurement.org/en>`_.
uk: Загальну інформацію, пояснення та технічні специфікації можна знайти на сайті `openprocurement.org <http://openprocurement.org/en>`_.

source: Information on work with Negotiation procurement procedure is in this `tutorial <http://limited.api-docs.openprocurement.org/en/latest/>`_.
uk: Інформація про переговорну процедуру знаходиться у цьому `туторіалі <http://limited.api-docs.openprocurement.org/uk/latest/>`_.

source: Instructions for the Open Procurement Open UA procedure can be found in this `documentation <http://openua.api-docs.openprocurement.org/en/latest/overview.html>`_.
uk: Інструкції для роботи з українською процедурою відкритих торгів можна знайти у цій `документації <http://openua.api-docs.openprocurement.org/en/latest/overview.html>`_.
