Repository: openprocurement/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/procuring.po
Languages: uk

source: Procuring Entity Operations
uk: Операції для організації-замовника закупівлі

source: Registration of the Tender
uk: Реєстрація Закупівлі

source: Creating primary Tender record
uk: Cтворення початкового запису Закупівлі

source: When registering tender in the database, one has provide all primary tender details (except binary documents) in payload of request.
uk: При реєстрації закупівлі у базі даних потрібно надати всі основні деталі закупівлі (окрім двійкових документів) в тілі запиту.

source: Uploading documentation
uk: Завантаження документації

source: Changing the Tender
uk: Зміна Закупівлі

source: Procuring Entity can change both the primary record and associated documentation.
uk: Замовник закупівлі може змінити і початковий запис, і відповідну документацію.

source: Changing primary Tender Record
uk: Зміна початкового запису Закупівлі

source: Changing existing documents
uk: Зміна існуючих документів

source: Uploading additional documents
uk: Завантаження додаткових документів

source: Example request:
uk: Приклад запиту:

source: Procuring Entity can upload new versions of the tender documentation. You can see supported request types in :ref:`upload` section.
uk: Замовник може завантажити нові версії документів закупівлі. Всі типи запитів, які підтримуються, ви можете побачити в секції :ref:`upload`.

source: The same as :ref:`procuring-uploading-docs`.
uk: Так само як :ref:`procuring-uploading-docs`.

source: Tender registration consists of primary record creation and documentation uploading.
uk: Реєстрація Закупівлі складається зі створення початкового запису та завантаження документації.

source: The produced response will contain URL of the created tender in Location header of response, and in ``data.id`` of body.
uk: Отримана відповідь міститиме URL створеної закупівлі у заголовку відповіді `Location` та у ``data.id`` тіла.

source: All tender documentation should be uploaded with the following request - one request per document. You can see supported request types in :ref:`upload` section.
uk: Вся документація закупівлі повинна бути завантажена такими запитами, по одному запиту на документ. Всі типи запитів, які підтримуються, ви можете побачити в секції :ref:`upload`.

source: The response produced will have URL of the tender uploaded document in Location header of response and in ``data.id`` of body.
uk: Отримана відповідь міститиме URL створеної закупівлі у заголовку відповіді `Location` та у ``data.id`` тіла.

source: Procuring Entity can change the Tender properties with the following request. Data to change should be in payload of the message.
uk: Замовник може змінити властивості Закупівлі за таким запитом. Інформація для зміни повинна міститися у вмісті повідомлення.
